#### Lispではグローバルに定義される変数をトップレベル変数と呼ぶ。

#### 新しいトップレベル定義にはdefparameterを使う
```
(defparameter *small* 1)
```
 \*small*についている\*は単なる習慣で、意味はない。
 だが、ローカル変数と区別するのに便利なので、使うのは推奨。

#### defparameterを使ってグローバル変数を定義すると、その変数が既に定義されていた場合、元の値は上書きされる。

```
> (defparameter *foo* 5)
*FOO*
5
> (defparameter *foo* 6)
*FOO*
6
```
#### defvar を使うと上書きされない

```
> (defvar *foo* 5)
*FOO*
5
> (defvar *foo* 6)
*FOO*
5

```

#### コマンドとその引数をいちいち括弧に入れてやらないとならない

#### 空白と改行は全て無視される

#### 関数はdefunを使って定義できる
```
(defun function_name (arguments)
 ...)

 > (defun guess-my-number ()
(ash (+ *small* *big*) -1))
GUESS-MY-NUMBER
```

#### 関数の後の空の括弧()は、この関数がパラメータを取らないことを示している。

#### ash関数は、渡された数値を2進数で考え、ビットを右または左にシフトする。

#### Lispでは整数に上限はない。
```
[4]> (ash 11 1)
22
[5]> (ash 11 -1)
5
```

#### 関数の最後の指揮の値が自動的に返されるので、return は書く必要はない

#### setf関数を使ってグローバル変数の値を書き換える

#### ローカル変数を定義するにはletコマンドを使う
```
(let (変数定義)
...本体...)
```

#### ローカル変数はfletコマンドで定義できる
```
(flet ((関数名(引数)
        ...関数本体...))
      ...本体...)
```

#### 一つのfletコマンドで複数のローカル関数を一緒に宣言するには、単にコマンドの最初の部分に複数の関数宣言を書けば良い。

#### ローカル関数の中で同じスコープで定義されるローカル関数名を使いたい場合は、labelsコマンドを使う。

```
(labels ((a (n)
            (+ n  5))
          (b (n)
             (+ (a n) 6)))
            (b 10))
```